In [2]:
import pandas as pd 
from parser import parser
import numpy as np

In [3]:
q569 = '''
+-----+------------+--------+
|Id   | Company    | Salary |
+-----+------------+--------+
|1    | A          | 2341   |
|2    | A          | 341    |
|3    | A          | 15     |
|4    | A          | 15314  |
|5    | A          | 451    |
|6    | A          | 513    |
|7    | B          | 15     |
|8    | B          | 13     |
|9    | B          | 1154   |
|10   | B          | 1345   |
|11   | B          | 1221   |
|12   | B          | 234    |
|13   | C          | 2345   |
|14   | C          | 2645   |
|15   | C          | 2645   |
|16   | C          | 2652   |
|17   | C          | 65     |
+-----+------------+--------+'''

In [35]:
df1 = parser(q569)
df1['Id'] = df1['Id'].astype(int)
df1['Salary'] = df1['Salary'].astype(float)

In [48]:
def median_finder(df):
    if len(df)%2 != 0:
        median_index = int((len(df)+ 1)/2)
        s = df.sort_values(['Salary'])
        return s.iloc[median_index:median_index+1, :] 
    else:
        median_index_1 = int(len(df)/2-1)
        median_index_2 = int(len(df)/2 )
        s = df.sort_values(['Salary'])
        return s.iloc[median_index_1: median_index_2+1,:]
df1.groupby(['Company']).apply(median_finder)

            Id Company  Salary
Company
A       4    5       A   451.0
        5    6       A   513.0
B       11  12       B   234.0
        8    9       B  1154.0
C       14  15       C  2645.0

In [49]:
question_570 = '''
+------+----------+-----------+----------+
|Id    |Name 	  |Department |ManagerId |
+------+----------+-----------+----------+
|101   |John 	  |A 	      |null      |
|102   |Dan 	  |A 	      |101       |
|103   |James 	  |A 	      |101       |
|104   |Amy 	  |A 	      |101       |
|105   |Anne 	  |A 	      |101       |
|106   |Ron 	  |B 	      |101       |
+------+----------+-----------+----------+
'''

In [60]:
df = parser(question_570)
df['Id'] = df['Id'].astype(int)
df['ManagerId'] = pd.to_numeric(df['ManagerId'], errors='igore')

In [64]:
df_employee = df[df.ManagerId.notnull()]
df_manager = df[df.ManagerId.isnull()]
merged_table = pd.merge(df_employee, df_manager, left_on='ManagerId', right_on='Id', how='right')
v = merged_table.Name_y.value_counts()
v[v>=5].index.tolist()

    Id   Name Department  ManagerId
1  102    Dan          A      101.0
2  103  James          A      101.0
3  104    Amy          A      101.0
4  105   Anne          A      101.0
5  106    Ron          B      101.0
    Id  Name Department  ManagerId
0  101  John          A        NaN

In [69]:
question_571 = '''
+----------+-------------+
|  Number  |  Frequency  |
+----------+-------------|
|  0       |  7          |
|  1       |  1          |
|  2       |  3          |
|  3       |  1          |
+----------+-------------+
'''

In [80]:
df = parser(question_571)
for i in df.columns:
    df[i] = pd.to_numeric(df[i])
m = np.median(np.repeat(df.values[:, 0], df.values[:, 1]))
print(m)

0.0

In [82]:
question_574_1 = '''
+-----+---------+
| id  | Name    |
+-----+---------+
| 1   | A       |
| 2   | B       |
| 3   | C       |
| 4   | D       |
| 5   | E       |
+-----+---------+  
'''

In [81]:
question_574_2 = '''
+-----+--------------+
| id  | CandidateId  |
+-----+--------------+
| 1   |     2        |
| 2   |     4        |
| 3   |     3        |
| 4   |     2        |
| 5   |     5        |
+-----+--------------+
'''

In [86]:
cand = parser(question_574_1)
vote = parser(question_574_2)
pd.merge(cand, vote, left_on='id', 
         right_on='CandidateId', 
         suffixes=['', '_voter'])['Name']\
        .value_counts().idxmax()

'B'

In [89]:
question_577_1 = '''
+-------+--------+-----------+--------+
| empId |  name  | supervisor| salary |
+-------+--------+-----------+--------+
|   1   | John   |  3        | 1000   |
|   2   | Dan    |  3        | 2000   |
|   3   | Brad   |  null     | 4000   |
|   4   | Thomas |  3        | 4000   |
+-------+--------+-----------+--------+
'''
question_577_2 = '''
+-------+-------+
| empId | bonus |
+-------+-------+
| 2     | 500   |
| 4     | 2000  |
+-------+-------+
'''
employee = parser(question_577_1)
employee['salary'] = employee['salary'].astype(int)
bonus = parser(question_577_2)
bonus['bonus'] = bonus['bonus'].astype(int)

In [98]:
result = pd.merge(employee, bonus, on='empId', how='left')
result = result.loc[(result['bonus'].isnull()) | (result['bonus'] < 2000), ['name', 'bonus']]
result

   name  bonus
0  John    NaN
1   Dan  500.0
2  Brad    NaN

In [129]:
question_578 = '''
+------+-----------+--------------+------------+-----------+------------+
| uid  | action    | question_id  | answer_id  | q_num     | timestamp  |
+------+-----------+--------------+------------+-----------+------------+
| 5    | show      | 285          | null       | 1         | 123        |
| 5    | answer    | 285          | 124124     | 1         | 124        |
| 5    | show      | 369          | null       | 2         | 125        |
| 5    | skip      | 369          | null       | 2         | 126        |
+------+-----------+--------------+------------+-----------+------------+
'''
answer = parser(question_578)
answer['answer_id'] = pd.to_numeric(answer['answer_id'], errors='coerce') #you have to use coerce!! not ignore

In [137]:
def user_analysis(df):
    if sum(df.answer_id.notnull()):
        return 1
    else:
        return 0
survey_log = answer.groupby('question_id').apply(user_analysis).idxmax()
pd.DataFrame({'survey_log':[survey_log]})

  survey_log
0        285

In [170]:
question_585 = '''
| PID | TIV_2015 | TIV_2016 | LAT | LON |
+-----|----------|----------|-----|-----|
| 1   | 10       | 5        | 10  | 10  |
| 2   | 20       | 20       | 20  | 20  |
| 3   | 10       | 30       | 20  | 20  |
| 4   | 10       | 40       | 40  | 40  |
'''
invest = parser(question_585)
for i in invest:
    invest[i] = pd.to_numeric(invest[i])

In [177]:
condition1 = invest.TIV_2015.duplicated(keep=False)
condition2 = ~invest[['LAT','LON']].duplicated(keep=False)
invest[condition1 & condition2].sum()['TIV_2016']

45

In [181]:
question_603 = '''
| seat_id | free |
+---------|------|
| 1       | 1    |
| 2       | 0    |
| 3       | 1    |
| 4       | 1    |
| 5       | 1    |
'''
seats = parser(question_603)
seats['seat_id'] = pd.to_numeric(seats['seat_id'])
seats['free'] = pd.to_numeric(seats['free'])

In [232]:
s1 = seats.values.repeat(5, axis=0)
s2 = np.tile(seats.values, [5,1])
combined = pd.DataFrame(np.concatenate([s1, s2], axis=1))
combined.columns = ['seat_id_1', 'free_1', 'seat_id_2', 'free_2']

In [249]:
m1 = np.abs(combined.seat_id_1 - combined.seat_id_2) == 1
m2 = combined.free_1 == 1
m3 =  combined.free_2 == 1
pd.unique(combined.loc[(m1 &m2 &m3), 'seat_id_1'])

array([3, 4, 5])

In [251]:
question_607_1 = '''
+----------+------+--------+-----------------+-----------+
| sales_id | name | salary | commission_rate | hire_date |
+----------+------+--------+-----------------+-----------+
|   1      | John | 100000 |     6           | 4/1/2006  |
|   2      | Amy  | 120000 |     5           | 5/1/2010  |
|   3      | Mark | 65000  |     12          | 12/25/2008|
|   4      | Pam  | 25000  |     25          | 1/1/2005  |
|   5      | Alex | 50000  |     10          | 2/3/2007  |
+----------+------+--------+-----------------+-----------+
'''
question_607_2 = '''
+---------+--------+------------+
| com_id  |  name  |    city    |
+---------+--------+------------+
|   1     |  RED   |   Boston   |
|   2     | ORANGE |   New York |
|   3     | YELLOW |   Boston   |
|   4     | GREEN  |   Austin   |
+---------+--------+------------+
'''
question_607_3 = '''
+----------+----------+---------+----------+--------+
| order_id |  date    | com_id  | sales_id | amount |
+----------+----------+---------+----------+--------+
| 1        | 1/1/2014 |    3    |    4     | 100000 |
| 2        | 2/1/2014 |    4    |    5     | 5000   |
| 3        | 3/1/2014 |    1    |    1     | 50000  |
| 4        | 4/1/2014 |    1    |    4     | 25000  |
+----------+----------+---------+----------+--------+
'''
sales_person = parser(question_607_1)
company = parser(question_607_2)
orders = parser(question_607_3)

In [252]:
sales_person

  sales_id  name  salary commission_rate   hire_date
0        1  John  100000               6    4/1/2006
1        2   Amy  120000               5    5/1/2010
2        3  Mark   65000              12  12/25/2008
3        4   Pam   25000              25    1/1/2005
4        5  Alex   50000              10    2/3/2007

In [269]:
transctions = pd.merge(pd.merge(sales_person, orders, on='sales_id', how='left'),
         company, 
         on='com_id', 
         how='left', 
         suffixes=['','_company'])[['name', 'name_company']]
red_sales = transctions.loc[t.name_company == 'RED','name'].tolist()
red_sales_non = []
for i in set(transctions.name.tolist()):
    if i in red_sales:
        pass
    else:
        red_sales_non.append(i)
print(red_sales_non)

['Alex', 'Mark', 'Amy']

In [276]:
question_610 = '''
| x  | y  | z  |
+----|----|----|
| 13 | 15 | 30 |
| 10 | 20 | 15 |
'''
triangle = parser(question_610)

In [277]:
for i in triangle.columns.tolist():
    triangle[i] = triangle[i].astype(int)
triangle

    x   y   z
0  13  15  30
1  10  20  15

In [279]:
def rule(row):
    if row.x**2 + row.y**2 >= row.z**2:
        return 'yes'
    else:
        return 'no'
triangle['triangle'] = triangle.apply(rule, axis=1)
triangle

In [288]:
question_612 = '''
| x  | y  |
+----|----|
| -1 | -1 |
| 0  | 0  |
| -1 | -2 |
'''
plane = parser(question_612)
plane['x'] = pd.to_numeric(plane['x'])
plane['y'] = pd.to_numeric(plane['y'])

In [295]:
c = np.concatenate([np.tile(plane.values, [3,1]), np.repeat(plane.values, 3, axis=0)], axis=1)
distance_ = pd.DataFrame(c, columns=['x_1', 'y_1', 'x_2','y_2'])

distance_results = distance_.apply(lambda df: np.abs(df.x_1 - df.x_2)**2 + np.abs(df.y_1 - df.y_2)**2, axis=1)
distance_results = distance_results[distance_results > 0]
distance_results.min()

In [316]:
question_615_1 = '''
| id | employee_id | amount | pay_date   |
+----|-------------|--------|------------|
| 1  | 1           | 9000   | 2017-03-31 |
| 2  | 2           | 6000   | 2017-03-31 |
| 3  | 3           | 10000  | 2017-03-31 |
| 4  | 1           | 7000   | 2017-02-28 |
| 5  | 2           | 6000   | 2017-02-28 |
| 6  | 3           | 8000   | 2017-02-28 |
'''
question_615_2 = '''
| employee_id | department_id |
+-------------|---------------|
| 1           | 1             |
| 2           | 2             |
| 3           | 2             |
'''

association = parser(question_615_2)
salary = parser(question_615_1)
salary['amount'] = pd.to_numeric(salary['amount'])
salary['pay_month'] = salary['pay_date'].str[0:7]
combined = pd.merge(association, salary)

In [340]:
def make_comparison(df):
    base_line_salary = df.amount.mean()
    dpt_ = df.groupby('department_id').mean()
    def func(r):
        if r > base_line_salary:
            return 'greater'
        elif r == base_line_salary:
            return 'same'
        else:
            return 'smaller'
    dpt_['decision'] = dpt_.amount.map(func)
    return dpt_
combined.groupby('pay_month').apply(make_comparison)

                         amount decision
pay_month department_id
2017-02   1                7000     same
          2                7000     same
2017-03   1                9000  greater
          2                8000  smaller